STMicroelectronics/stm32u083c-dk-bsp/stm32u083c_discovery.c
  if (COM >= COMn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_UART_RESET_HANDLE_STATE(&hcom_uart[COM]);

    /* Register MspInit/MspDeInit Callbacks */
    if (HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPINIT_CB_ID, Callback->pMspInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPDEINIT_CB_ID, Callback->pMspDeInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsComMspCbValid[COM] = 1U;
    }
  }

  /* BSP status */
  return ret;
}
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

#if (USE_COM_LOG > 0)
/**
  * @brief  Select the active COM port.
  * @param  COM port to be activated.
  * @retval BSP status
  */
int32_t BSP_COM_SelectLogPort(COM_TypeDef COM)
{
  if (COM_ActiveLogPort != COM)
  {
    COM_ActiveLogPort = COM;
  }
  return BSP_ERROR_NONE;
}

/**
  * @brief  Redirect console output to COM
  */
#ifdef __GNUC__
int __io_putchar(int ch)
{
  HAL_UART_Transmit(&hcom_uart [COM_ActiveLogPort], (uint8_t *) &ch, 1, COM_POLL_TIMEOUT);
  return ch;
}
#else
size_t __write(int handle, const unsigned char *buffer, size_t size)
{
  HAL_UART_Transmit(&hcom_uart [COM_ActiveLogPort], (uint8_t *) buffer, size, COM_POLL_TIMEOUT);
  return size;
}
#endif /* __GNUC__ */
#endif /* USE_COM_LOG */
#endif /* USE_BSP_COM_FEATURE */

#if (USE_BSP_JOY_FEATURE > 0)
/**
  * @brief  Configures joystick GPIO and EXTI modes.
  * @param  JOY Joystick to be initialized
  * @param  JoyMode Button mode.
  *          This parameter can be one of the following values:
  *            @arg  JOY_MODE_GPIO: Joystick pins will be used as simple IOs
  *            @arg  JOY_MODE_EXTI: Joystick pins will be connected to EXTI line
  *                                 with interrupt generation capability
  * @param  JoyPins joystick pins to be initialized
  * @retval BSP status
  */
int32_t BSP_JOY_Init(JOY_TypeDef JOY, JOYMode_TypeDef JoyMode, JOYPin_TypeDef JoyPins)
{
  int32_t ret = BSP_ERROR_NONE;

  UNUSED(JoyMode);
  UNUSED(JoyPins);

  if (JOY >= JOYn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 0)
    /* Init the ADC Msp */
    ADC_MspInit(&hjoy_adc);
#else
    if (IsJoyMspCbValid[JOY] == 0U)
    {
      if (BSP_JOY_RegisterDefaultMspCallbacks(JOY) != BSP_ERROR_NONE)
      {
        return BSP_ERROR_MSP_FAILURE;
      }
    }
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
    if (MX_ADC_Init(&hjoy_adc) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

/**
  * @brief  De-Initialize the Potentiometer.
  * @param  JOY  Potentiometer to be activated.
  * @param  JoyPins joystick pins to be de-initialized
  * @retval BSP status
  */
int32_t BSP_JOY_DeInit(JOY_TypeDef JOY, JOYPin_TypeDef JoyPins)
{
  int32_t ret = BSP_ERROR_NONE;

  UNUSED(JoyPins);

  if (JOY >= JOYn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* ADC configuration */
    hjoy_adc.Instance = JOY1_ADC;

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 0)
    ADC_MspDeInit(&hjoy_adc);

#endif /* (USE_HAL_ADC_REGISTER_CALLBACKS == 0) */

    if (HAL_ADC_DeInit(&hjoy_adc) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

/**
  * @brief  Returns the current joystick status.
  * @param  JOY Joystick instance
  * @retval BSP error code if value is negative or one of the following values:
  *            @arg  JOY_NONE  if voltage level is not one of below values
  *            @arg  JOY_SEL   if voltage level is around  0 V / 0
  *            @arg  JOY_DOWN  if voltage level is between 1.32 V / 1638
  *            @arg  JOY_LEFT  if voltage level is between 0.67 V / 831
  *            @arg  JOY_RIGHT if voltage level is between 2.65 V / 3288
  *            @arg  JOY_UP    if voltage level is between 2.01 V / 2494
  */
int32_t BSP_JOY_GetState(JOY_TypeDef JOY)
{
  int32_t ret = BSP_ERROR_NONE;
  uint16_t key_converted_value = 0;
  uint32_t key_pressed;

  if (JOY >= JOYn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Start the conversion process */
    HAL_ADC_Start(&hjoy_adc);

    /* Wait for the end of conversion */
    if (HAL_ADC_PollForConversion(&hjoy_adc, JOY_ADC_POLL_TIMEOUT) != HAL_TIMEOUT)
    {
      /* Get the converted value of regular channel */
      key_converted_value = HAL_ADC_GetValue(&hjoy_adc);
    }
    if ((key_converted_value > 2370) && (key_converted_value < 2618))
    {
      key_pressed = JOY_UP;
    }
    else if ((key_converted_value > 3000) && (key_converted_value < 3312))
    {
      key_pressed = JOY_RIGHT;
    }
    else if (key_converted_value < 10)
    {
      key_pressed = JOY_SEL;
    }
    else if ((key_converted_value > 1514) && (key_converted_value < 1762))
    {
      key_pressed = JOY_DOWN;
    }
    else if ((key_converted_value > 709) && (key_converted_value < 955))
    {
      key_pressed = JOY_LEFT;
    }
    else
    {
      key_pressed = JOY_NONE;
    }
    /* Return Code Joystick key pressed */
    ret = (int32_t)key_pressed;
  }

  return (int32_t)ret;
}

/**
  * @brief  Configures ADC peripheral
  * @param  hadc ADC handle
  * @retval HAL error code
  */
__weak HAL_StatusTypeDef MX_ADC_Init(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef ret = HAL_OK;
  ADC_ChannelConfTypeDef sConfig;

  /* ADC configuration */
  hadc->Instance                   = JOY1_ADC;
  hadc->Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV4;   /* ADC clock of STM32U0 must not exceed 14MHz        */
  hadc->Init.Resolution            = ADC_RESOLUTION_12B;
  hadc->Init.DataAlign             = ADC_DATAALIGN_RIGHT;
  hadc->Init.ScanConvMode          = ADC_SCAN_DIRECTION_FORWARD; /* Sequencer will convert the number of channels
                                       configured below, successively from the lowest to the highest channel number */
  hadc->Init.EOCSelection          = ADC_EOC_SINGLE_CONV;
  hadc->Init.LowPowerAutoWait      = DISABLE;
  hadc->Init.LowPowerAutoPowerOff  = DISABLE;
  hadc->Init.ContinuousConvMode    = DISABLE;                    /* Continuous mode disabled to have only 1
                                                                  conversion at each conversion trig                */
  hadc->Init.NbrOfConversion       = 1;
  hadc->Init.DiscontinuousConvMode = DISABLE;                    /* Parameter discarded because sequencer is disabled */
  hadc->Init.ExternalTrigConv      = ADC_SOFTWARE_START;         /* Software start to trig the 1st conversion
                                                                            manually, without external event        */
  hadc->Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE; /* Parameter discarded because trig by
                                                                            software start                          */
  hadc->Init.DMAContinuousRequests = DISABLE;
  hadc->Init.Overrun               = ADC_OVR_DATA_OVERWRITTEN;
  hadc->Init.SamplingTimeCommon1   = ADC_SAMPLETIME_39CYCLES_5;
  hadc->Init.OversamplingMode      = DISABLE;

  if (HAL_ADC_Init(hadc) != HAL_OK)
  {
    ret =  HAL_ERROR;
  }/* Run ADC calibration */
  else if (HAL_ADCEx_Calibration_Start(hadc) != HAL_OK)
  {
    return HAL_ERROR;
  }
  else
  {
    /**Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time */
    sConfig.Channel      = JOY1_ADC_CHANNEL;
    sConfig.Rank         = 1;
    sConfig.SamplingTime = JOY1_SAMPLING_TIME;
#if defined(ADC_SINGLE_ENDED)
    sConfig.SingleDiff   = ADC_SINGLE_ENDED;
#endif /* ADC_SINGLE_ENDED */
#if defined(ADC_OFFSET_NONE)
    sConfig.OffsetNumber = ADC_OFFSET_NONE;
#endif /* ADC_OFFSET_NONE */
    if (HAL_ADC_ConfigChannel(hadc, &sConfig) != HAL_OK)
    {
      ret =  HAL_ERROR;
    }
  }

  return ret;
}
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
/**
  * @brief Register Default Potentiometer Msp Callbacks
  * @param JOY Potentiometer instance
  * @retval BSP status
  */
int32_t BSP_JOY_RegisterDefaultMspCallbacks(JOY_TypeDef JOY)
{
  int32_t ret = BSP_ERROR_NONE;

  if (JOY >= JOYn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_ADC_RESET_HANDLE_STATE(&hjoy_adc);

